# http://ix.io from Reddit user ftrx who complains about Hyperbole a lot (he uses Org Mode), but wants to figure out how to use it
#+TITLE: My Emacs "home" setup
#+SUBTITLE: in replay to rswgnu

* Basic "data" layout
In years I create my personal taxonomy, stable enough that I practically
do not change it's structure except for the deepest leafs of it. The
main layout is

#+BEGIN_SRC sh
ls ~
#+END_SRC

#+RESULTS:
| Desktop  | <= autocreated by unknown X apps, empty
| docs     | <= personal documents archive
| env      | <= my configs
| kl       | <= my personal library
| mail     | <= my local maildir indexed by notmuch
| media    | <= photos, music, movies
| notes    | <= my main org-based taxonomy
| prjs     | <= personal projects (not only IT related)
| work     | <= work related taxonomy
| tmp      | <= tarr pit cleaned up casually, erased once a year

Any (except mail) top level directory (and many subdirs) have an org file
with the same filename

#+BEGIN_SRC sh
ls */*.org
#+END_SRC

#+RESULTS:
| docs/docs.org   |
| env/env.org     |
| kl/kl.org       |
| media/media.org |
| notes/notes.org |
| prjs/prjs.org   |
| work/index.org  |
| tmp/tmp.org     |

And all of them are linked in a local heading structure in
   ~/env/emacs/linkmarks.org

The relevant linkmarks setup, after cloning the repo (I do not use
straight or similar, but perhaps in the next Emacs config rewrite
I'll adopt it) is
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/env/emacs/scmpkgs/linkmarks")
(require 'linkmarks)
(setq linkmarks-file "~/env/emacs/linkmarks.org")
(global-set-key (kbd "<XF86AudioStop>") 'linkmarks-select)
(exwm-input-set-key (kbd "<XF86AudioStop>") #'linkmarks-select)
#+END_SRC

The "double" bindings is to have it in the rare case I'm log in
without X. In the next Emacs cleanup I'll wrap all my bindings so
to have anything in a ~* keybindigs~ heading.

Any top-level org files (and many subfiles) with their headings have
a drawer with an ~ID~ or ~CUSTOM_ID~ property like
#+BEGIN_EXAMPLE
